#+title: tecgraf.org
#+1author: kenjirofukuda@gmail.com
#+options: toc:nil num:nil ^:nil ^:{}
#+HTML_HEAD_EXTRA: <style> .figure p {text-align: left;}</style>
#+HTML_HEAD_EXTRA: <script src="https://cdn.jsdelivr.net/npm/mermaid@11.12.0/dist/mermaid.min.js"></script>

* Links
- IUP :: https://www.tecgraf.puc-rio.br/iup/
- CD :: https://www.tecgraf.puc-rio.br/cd/
- IM :: https://www.tecgraf.puc-rio.br/im/
- TECMAKE :: https://www.tecgraf.puc-rio.br/tecmake/en/main.html
- Lua :: https://luabinaries.sourceforge.net/download.html
  
* current SVN version

| im   | r820  |
| cd   | r901  |
| ftgl | r901  |
| iup  | r5971 |


* TARGET
** TARGET = GTK
#+begin_src bash :results output 
  cat <<EOM > /tmp/target.env
  export REMOTE_IUP_GO_REPO="https://github.com/gen2brain/iup-go.git"
  export LOCAL_IUP_GO_REPO="${TECTOOLS_HOME}/iup-go"
  
  export USE_GTK=Yes
  export USE_GTK3=Yes
  export USE_MOTIF=
  export USE_X11=
  export EXCLUDE_TARGETS="cdpdf cdluapdf5"
  EOM
  cat /tmp/target.env
#+end_src

** TARGET = MOTIF
#+begin_src bash 
  cat <<EOM > /tmp/target.env
  export REMOTE_IUP_GO_REPO="https://github.com/gen2brain/iup-go.git"
  export LOCAL_IUP_GO_REPO="${TECTOOLS_HOME}/iup-go"
  
  export USE_GTK=
  export USE_GTK3=
  export USE_MOTIF=Yes
  export USE_X11=Yes
  export EXCLUDE_TARGETS="cdpdf cdluapdf5 iupweb iup_scintilla iupvled" 
  EOM
  cat /tmp/target.env
#+end_src


* LUA
基本的に、コマンドの実行自身はディストリビューションの標準パッケージンを使用する。
ここで必要なのはオブジェクトファイル群である。

- https://sourceforge.net/projects/luabinaries/files/5.4.2/Docs%20and%20Sources/lua-5.4.2_Sources.tar.gz/download

** lua downloads
#+begin_src bash :results output
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  SLV=$(echo "$USE_LUA_VERSION" | tr -d '.')
  # echo "$SLV"
  lua_dir="${TECTOOLS_HOME}/lua${SLV}"
  if [ ! -d "$lua_dir" ]; then

      SRC_URL="https://sourceforge.net/projects/luabinaries/files/5.1.5/Docs%20and%20Sources/lua5_1_5_Sources.tar.gz/download"
      if [ "${USE_LUA_VERSION}" == "5.4" ]; then
  	SRC_URL="https://sourceforge.net/projects/luabinaries/files/5.4.2/Docs%20and%20Sources/lua-5.4.2_Sources.tar.gz/download"
      fi
      if [ "${USE_LUA_VERSION}" == "5.3" ]; then
  	SRC_URL="https://sourceforge.net/projects/luabinaries/files/5.3.6/Docs%20and%20Sources/lua-5.3.6_Sources.tar.gz/download"
      fi
      if [ "${USE_LUA_VERSION}" == "5.2" ]; then
  	SRC_URL="https://sourceforge.net/projects/luabinaries/files/5.2.4/Docs%20and%20Sources/lua-5.2.4_Sources.tar.gz/download"
      fi
      basename=$(echo "${SRC_URL}" | cut -f 9 -d '/')
      echo "$basename"
      dest_dir="${TECGRAF_REPO_ROOT}/archives"
      dest_path="${dest_dir}/${basename}"
      if [ ! -f "${dest_path}" ]; then
  	mkdir -p "${dest_dir}"
  	curl -L -o "${dest_path}" "${SRC_URL}"
      fi
      tar -xzf "${dest_path}" -C "${TECTOOLS_HOME}"
  fi
  cd "${lua_dir}/src"
  make -f Makefile.tecmake lualib
#+end_src


** lua install (deprecated)
#+begin_src bash :results output
  echo deprecated install lua aooficial repository
  echo please install luabinaries version.
  exit 0
  if [ -z "${TECTOOLS_HOME}" ]; then
      echo "Environment variable not set: TECTOOLS_HOME"
      exit 1
  fi
  if [ -z "${TECGRAF_REPO_ROOT}" ]; then
      echo "Environment variable not set: TECGRAF_REPO_ROOT"
      exit 1
  fi
  LUA_SLV=$(echo "$USE_LUA_VERSION" | tr -d '.')
  # echo "$LUA_SLV"
  lua_dir="${TECTOOLS_HOME}/lua${LUA_SLV}"
  if [ -d "$lua_dir" ]; then
      echo "already extracted $(basename $lua_dir)"
      exit 0
  fi
  long_ver=$(lua -v | cut -f2 -d' ')
  echo TODO extract $long_ver
  basename="lua-${long_ver}.tar.gz"
  url="https://www.lua.org/ftp/${basename}"
  echo start download $url
  archive_download_dir="${TECGRAF_REPO_ROOT}/archives"
  archive="$archive_download_dir/${basename}"
  mkdir -p "$archive_download_dir"
  cd "$archive_download_dir"
  if [ -f "$archive" ]; then
      echo "already downloaded $basename"
  else
      curl -O "$url"
      ls -la 
  fi
  mkdir -p "${lua_dir}"
  tar -xzf "${archive}" --strip-components=1 -C "${lua_dir}/"
  exit 0
#+end_src

** シンボリックリンクによる不具合回避
サフィックス命名規則にブレが有り、実態と一致していないところがあるのでシンボリックリンクでカバーする。
version 5.4の場合

| 実在             | /usr/bin/lua5.4 |
| スクリプトが要求 | /usr/bin/lua54  |

#+begin_src bash :results output
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  if [ -z "${USE_LUA_VERSION}" ]; then
      echo "Environment variable not set: USE_LUA_VERSION"
      exit 1
  fi
  SLV=$(echo "$USE_LUA_VERSION" | tr -d '.')
  SRC_CMD="lua${USE_LUA_VERSION}"
  DST_CMD="lua${SLV}"
  SRC_PATH="$(command -v $SRC_CMD)"
  DST_PATH="$(dirname $SRC_PATH)/${DST_CMD}"
  if ! command -v $SRC_CMD &> /dev/null; then
     echo "command not found $DST_CMD"
     exit 1
  fi
  if command -v $DST_CMD &> /dev/null; then
     echo "already exists $DST_CMD"
     exit 1
  fi
  echo sudo ln -s "${SRC_PATH}" "${DST_PATH}"
#+end_src


** lua build
#+begin_src bash :session tecgraf-session
  if [ -z "${TECTOOLS_HOME}" ]; then
      echo "Environment variable not set: TECTOOLS_HOME"
      exit 1
  fi
  if [ -z "${TECGRAF_REPO_ROOT}" ]; then
      echo "Environment variable not set: TECGRAF_REPO_ROOT"
      exit 1
  fi
  LUA_SLV=$(echo $USE_LUA_VERSION | tr -d '.')
  # echo $LUA_SLV
  lua_dir="${TECTOOLS_HOME}/lua${LUA_SLV}"
  if [ ! -d "$lua_dir" ]; then
      echo "ERROR: directory not found $lua_dir"
      exit 1
  fi
  echo build
  cd "$lua_dir"
  make
#+end_src


* IM
- @see https://www.tecgraf.puc-rio.br/im/en/guide.html

** svn install
- @see https://www.tecgraf.puc-rio.br/im/en/svn.html
#+begin_src bash 
  mkdir -p "${TECTOOLS_HOME}"
  if [ -d "${TECTOOLS_HOME}/im" ]; then
      echo "im already checkuout."
  else
      cd "${TECTOOLS_HOME}"
      svn checkout -r820 svn://svn.code.sf.net/p/imtoolkit/im/trunk/im im
  fi
  exit 0
#+end_src


#+begin_src bash 
env | grep USE_ | sort
#+end_src

** patch to im
#+begin_src bash 
  if [ ! -d "${TECTOOLS_HOME}/im" ]; then
      echo "im not found."
      exit 1
  fi
  patch_file="${TECGRAF_REPO_ROOT}/patches/im.svn.diff"
  if [ ! -f "$patch_file" ]; then
      echo "patchfile not found."
      exit 1
  fi
  cd "${TECTOOLS_HOME}/im"
  patch -p0 < "$patch_file"
  exit 0
#+end_src


** clean im
#+begin_src bash 
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/im/src/ && make -f ../tecmake.mak clean clean-extra
  cd  ${TECTOOLS_HOME}/im/ && rm -rf obj lib
  cd  ${TECTOOLS_HOME}/im/ && find . -type d -name "dep" -exec rm -rf \{\} \;
      #+end_src

#+RESULTS:
| Tecmake: | Building | Dependencies                     | ...                               | [                                   | dep/im.dep.Linux612_64         | ]                              | (can                               | be                                 | slow)                       |                                    |                                    |                                       |                                 |                                    |                                  |                                    |                                  |                                    |                               |                                 |                                   |                                    |                             |                                    |                                   |                                    |                                 |                                    |                                       |                                    |                                 |                             |                                      |                                 |                                    |                                  |                              |                             |                                    |                                     |                                    |                                     |                            |                            |                          |                              |                                   |                               |                                |                                |                                   |                              |                               |                                |                                |                              |                                |                                |                                    |                               |                               |                                   |                               |                               |                                  |                              |                                 |                                   |                               |                                  |                                |                                   |                              |                                  |                                   |                                  |                                  |                                |                                  |                                |                               |                               |                                   |                               |                               |                               |                              |                              |                               |                               |                               |                               |                             |                              |                               |                              |                               |                               |                               |                               |                              |                              |                               |                               |                               |                              |                               |                               |                              |                               |                              |                             |                               |                              |                               |                             |                              |                             |                               |                               |                               |                               |                              |                               |                              |                             |                               |                               |                              |                                      |                                           |                                       |                                     |                                            |                                        |                                      |                                              |                                          |                                        |                                             |                                         |                                       |                                      |                                 |                                 |                                  |                                      |                                   |                               |                               |                                |                                  |                               |                               |
| rm       | -f       | ../lib/Linux612_64/libim.a       | ../lib/Linux612_64/libim.so       |                                     |                                |                                |                                    |                                    |                             |                                    |                                    |                                       |                                 |                                    |                                  |                                    |                                  |                                    |                               |                                 |                                   |                                    |                             |                                    |                                   |                                    |                                 |                                    |                                       |                                    |                                 |                             |                                      |                                 |                                    |                                  |                              |                             |                                    |                                     |                                    |                                     |                            |                            |                          |                              |                                   |                               |                                |                                |                                   |                              |                               |                                |                                |                              |                                |                                |                                    |                               |                               |                                   |                               |                               |                                  |                              |                                 |                                   |                               |                                  |                                |                                   |                              |                                  |                                   |                                  |                                  |                                |                                  |                                |                               |                               |                                   |                               |                               |                               |                              |                              |                               |                               |                               |                               |                             |                              |                               |                              |                               |                               |                               |                               |                              |                              |                               |                               |                               |                              |                               |                               |                              |                               |                              |                             |                               |                              |                               |                             |                              |                             |                               |                               |                               |                               |                              |                               |                              |                             |                               |                               |                              |                                      |                                           |                                       |                                     |                                            |                                        |                                      |                                              |                                          |                                        |                                             |                                         |                                       |                                      |                                 |                                 |                                  |                                      |                                   |                               |                               |                                |                                  |                               |                               |
| rm       | -f       | ../obj/Linux612_64/im_oldcolor.o | ../obj/Linux612_64/im_oldresize.o | ../obj/Linux612_64/im_converttype.o | ../obj/Linux612_64/im_attrib.o | ../obj/Linux612_64/im_format.o | ../obj/Linux612_64/im_format_tga.o | ../obj/Linux612_64/im_filebuffer.o | ../obj/Linux612_64/im_bin.o | ../obj/Linux612_64/im_format_all.o | ../obj/Linux612_64/im_format_raw.o | ../obj/Linux612_64/im_convertopengl.o | ../obj/Linux612_64/im_binfile.o | ../obj/Linux612_64/im_format_sgi.o | ../obj/Linux612_64/im_datatype.o | ../obj/Linux612_64/im_format_pcx.o | ../obj/Linux612_64/im_colorhsi.o | ../obj/Linux612_64/im_format_bmp.o | ../obj/Linux612_64/im_image.o | ../obj/Linux612_64/im_rgb2map.o | ../obj/Linux612_64/im_colormode.o | ../obj/Linux612_64/im_format_gif.o | ../obj/Linux612_64/im_lib.o | ../obj/Linux612_64/im_format_pnm.o | ../obj/Linux612_64/im_colorutil.o | ../obj/Linux612_64/im_format_ico.o | ../obj/Linux612_64/im_palette.o | ../obj/Linux612_64/im_format_ras.o | ../obj/Linux612_64/im_convertbitmap.o | ../obj/Linux612_64/im_format_led.o | ../obj/Linux612_64/im_counter.o | ../obj/Linux612_64/im_str.o | ../obj/Linux612_64/im_convertcolor.o | ../obj/Linux612_64/im_fileraw.o | ../obj/Linux612_64/im_format_krn.o | ../obj/Linux612_64/im_compress.o | ../obj/Linux612_64/im_file.o | ../obj/Linux612_64/im_old.o | ../obj/Linux612_64/im_format_pfm.o | ../obj/Linux612_64/im_format_tiff.o | ../obj/Linux612_64/im_format_png.o | ../obj/Linux612_64/im_format_jpeg.o | ../obj/Linux612_64/lzf_c.o | ../obj/Linux612_64/lzf_d.o | ../obj/Linux612_64/lz4.o | ../obj/Linux612_64/tif_aux.o | ../obj/Linux612_64/tif_dirwrite.o | ../obj/Linux612_64/tif_jpeg.o | ../obj/Linux612_64/tif_print.o | ../obj/Linux612_64/tif_close.o | ../obj/Linux612_64/tif_dumpmode.o | ../obj/Linux612_64/tif_luv.o | ../obj/Linux612_64/tif_read.o | ../obj/Linux612_64/tif_codec.o | ../obj/Linux612_64/tif_error.o | ../obj/Linux612_64/tif_lzw.o | ../obj/Linux612_64/tif_strip.o | ../obj/Linux612_64/tif_color.o | ../obj/Linux612_64/tif_extension.o | ../obj/Linux612_64/tif_next.o | ../obj/Linux612_64/tif_swab.o | ../obj/Linux612_64/tif_compress.o | ../obj/Linux612_64/tif_fax3.o | ../obj/Linux612_64/tif_open.o | ../obj/Linux612_64/tif_thunder.o | ../obj/Linux612_64/tif_dir.o | ../obj/Linux612_64/tif_fax3sm.o | ../obj/Linux612_64/tif_packbits.o | ../obj/Linux612_64/tif_tile.o | ../obj/Linux612_64/tif_dirinfo.o | ../obj/Linux612_64/tif_flush.o | ../obj/Linux612_64/tif_pixarlog.o | ../obj/Linux612_64/tif_zip.o | ../obj/Linux612_64/tif_dirread.o | ../obj/Linux612_64/tif_getimage.o | ../obj/Linux612_64/tif_predict.o | ../obj/Linux612_64/tif_version.o | ../obj/Linux612_64/tif_write.o | ../obj/Linux612_64/tif_warning.o | ../obj/Linux612_64/tif_ojpeg.o | ../obj/Linux612_64/tif_lzma.o | ../obj/Linux612_64/tif_jbig.o | ../obj/Linux612_64/tiff_binfile.o | ../obj/Linux612_64/jcapimin.o | ../obj/Linux612_64/jcmarker.o | ../obj/Linux612_64/jdapimin.o | ../obj/Linux612_64/jdinput.o | ../obj/Linux612_64/jdtrans.o | ../obj/Linux612_64/jcapistd.o | ../obj/Linux612_64/jcmaster.o | ../obj/Linux612_64/jdapistd.o | ../obj/Linux612_64/jdmainct.o | ../obj/Linux612_64/jerror.o | ../obj/Linux612_64/jmemmgr.o | ../obj/Linux612_64/jccoefct.o | ../obj/Linux612_64/jcomapi.o | ../obj/Linux612_64/jdatadst.o | ../obj/Linux612_64/jdmarker.o | ../obj/Linux612_64/jfdctflt.o | ../obj/Linux612_64/jmemnobs.o | ../obj/Linux612_64/jccolor.o | ../obj/Linux612_64/jcparam.o | ../obj/Linux612_64/jdatasrc.o | ../obj/Linux612_64/jdmaster.o | ../obj/Linux612_64/jfdctfst.o | ../obj/Linux612_64/jquant1.o | ../obj/Linux612_64/jcdctmgr.o | ../obj/Linux612_64/jdcoefct.o | ../obj/Linux612_64/jdmerge.o | ../obj/Linux612_64/jfdctint.o | ../obj/Linux612_64/jquant2.o | ../obj/Linux612_64/jchuff.o | ../obj/Linux612_64/jcprepct.o | ../obj/Linux612_64/jdcolor.o | ../obj/Linux612_64/jidctflt.o | ../obj/Linux612_64/jutils.o | ../obj/Linux612_64/jdarith.o | ../obj/Linux612_64/jcinit.o | ../obj/Linux612_64/jcsample.o | ../obj/Linux612_64/jddctmgr.o | ../obj/Linux612_64/jdpostct.o | ../obj/Linux612_64/jidctfst.o | ../obj/Linux612_64/jaricom.o | ../obj/Linux612_64/jcmainct.o | ../obj/Linux612_64/jctrans.o | ../obj/Linux612_64/jdhuff.o | ../obj/Linux612_64/jdsample.o | ../obj/Linux612_64/jidctint.o | ../obj/Linux612_64/jcarith.o | ../obj/Linux612_64/im_sysfile_unix.o | ../obj/Linux612_64/exif-mnote-data-fuji.o | ../obj/Linux612_64/mnote-fuji-entry.o | ../obj/Linux612_64/mnote-fuji-tag.o | ../obj/Linux612_64/exif-mnote-data-canon.o | ../obj/Linux612_64/mnote-canon-entry.o | ../obj/Linux612_64/mnote-canon-tag.o | ../obj/Linux612_64/exif-mnote-data-olympus.o | ../obj/Linux612_64/mnote-olympus-entry.o | ../obj/Linux612_64/mnote-olympus-tag.o | ../obj/Linux612_64/exif-mnote-data-pentax.o | ../obj/Linux612_64/mnote-pentax-entry.o | ../obj/Linux612_64/mnote-pentax-tag.o | ../obj/Linux612_64/exif-byte-order.o | ../obj/Linux612_64/exif-entry.o | ../obj/Linux612_64/exif-utils.o | ../obj/Linux612_64/exif-format.o | ../obj/Linux612_64/exif-mnote-data.o | ../obj/Linux612_64/exif-content.o | ../obj/Linux612_64/exif-ifd.o | ../obj/Linux612_64/exif-tag.o | ../obj/Linux612_64/exif-data.o | ../obj/Linux612_64/exif-loader.o | ../obj/Linux612_64/exif-log.o | ../obj/Linux612_64/exif-mem.o |
| rm       | -f       | dep/im.dep.Linux612_64           | ./im                              | so_locations                        |                                |                                |                                    |                                    |                             |                                    |                                    |                                       |                                 |                                    |                                  |                                    |                                  |                                    |                               |                                 |                                   |                                    |                             |                                    |                                   |                                    |                                 |                                    |                                       |                                    |                                 |                             |                                      |                                 |                                    |                                  |                              |                             |                                    |                                     |                                    |                                     |                            |                            |                          |                              |                                   |                               |                                |                                |                                   |                              |                               |                                |                                |                              |                                |                                |                                    |                               |                               |                                   |                               |                               |                                  |                              |                                 |                                   |                               |                                  |                                |                                   |                              |                                  |                                   |                                  |                                  |                                |                                  |                                |                               |                               |                                   |                               |                               |                               |                              |                              |                               |                               |                               |                               |                             |                              |                               |                              |                               |                               |                               |                               |                              |                              |                               |                               |                               |                              |                               |                               |                              |                               |                              |                             |                               |                              |                               |                             |                              |                             |                               |                               |                               |                               |                              |                               |                              |                             |                               |                               |                              |                                      |                                           |                                       |                                     |                                            |                                        |                                      |                                              |                                          |                                        |                                             |                                         |                                       |                                      |                                 |                                 |                                  |                                      |                                   |                               |                               |                                |                                  |                               |                               |


** build im
#+begin_src bash :results list
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/im || echo not found im
  debug_tec_uname
  env | egrep  '(LUA|TEC)'
  make -e -j$(nproc) &> /tmp/im.log
#+end_src



** backup im
#+begin_src bash 
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  backup_tecgraf_build_result im
#+end_src


* CD
- @see https://www.tecgraf.puc-rio.br/cd/en/guide.html
** svn install
- @see https://www.tecgraf.puc-rio.br/cd/en/svn.html
#+begin_src bash
  if [ -d ${TECTOOLS_HOME}/cd ]; then
      echo "cd already checkuout."
  else
      cd ${TECTOOLS_HOME}
      svn checkout -r901 svn://svn.code.sf.net/p/canvasdraw/cd/trunk/cd cd 
  fi

  if [ -d ${TECTOOLS_HOME}/ftgl ]; then
      echo "ftgl already checkuout."
  else
      cd ${TECTOOLS_HOME}
      svn checkout -r901 svn://svn.code.sf.net/p/canvasdraw/cd/trunk/ftgl ftgl
  fi
  exit 0
#+end_src


** patch to ftgl
#+begin_src bash
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  if [ ! -d "${TECTOOLS_HOME}/ftgl" ]; then
      echo "ftgl not found."
      exit 1
  fi
  patch_file="${TECGRAF_REPO_ROOT}/patches/ftgl.svn.diff"
  if [ ! -f "$patch_file" ]; then
      echo "patchfile not found."
      exit 1
  fi
  cd "${TECTOOLS_HOME}/ftgl"
  patch -p0 < "$patch_file"
  exit 0
#+end_src


** clean ftgl
#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/ftgl/src/ && make -f ../tecmake.mak clean clean-extra
  cd  ${TECTOOLS_HOME}/ftgl/ && rm -rf obj lib
  cd  ${TECTOOLS_HOME}/ftgl/ && find . -type d -name "dep" -exec rm -rf \{\} \;

      #+end_src


#+begin_src bash :results output
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  env | egrep  '(LUA|TEC)'
  cd  ${TECTOOLS_HOME}/ftgl || echo not found ftgl
  debug_tec_uname
  make -e -j$(nproc) &> /tmp/ftgl.log
#+end_src



** backup ftgl
#+begin_src bash 
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  backup_tecgraf_build_result ftgl
#+end_src


** install ftgl

#+begin_src bash
  set -ve
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  if [ ! -d "${TECTOOLS_HOME}/ftgl" ]; then
      echo "ftgl not found."
      exit 1
  fi
  cd "${TECTOOLS_HOME}/ftgl"
  make
  if [ ! -f "${TECTOOLS_HOME}/ftgl/lib/${TEC_UNAME}/libftgl.a" ]; then
      echo "libftgl.a not found."
      exit 1
  fi
  if [ ! -f "${TECTOOLS_HOME}/ftgl/lib/${TEC_UNAME}/libftgl.so" ]; then
      echo "libftgl.so not found."
      exit 1
  fi
  sudo -E cp "${TECTOOLS_HOME}/ftgl/lib/${TEC_UNAME}/libftgl.a" /usr/lib/
  sudo -E cp "${TECTOOLS_HOME}/ftgl/lib/${TEC_UNAME}/libftgl.so" /usr/lib/
#+end_src


** patch to cd
#+begin_src bash
  set -ve
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  if [ ! -d "${TECTOOLS_HOME}/cd" ]; then
      echo "cd not found."
      exit 1
  fi
  patch_file="${TECGRAF_REPO_ROOT}/patches/cd.svn.diff"
  if [ ! -f "$patch_file" ]; then
      echo "patchfile not found."
      exit 1
  fi
  cd "${TECTOOLS_HOME}/cd"
  patch -p0 / && rm -rf obj lib

      #+end_src


#+begin_src bash :results output
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  env | egrep  '(LUA|TEC)'
  cd  ${TECTOOLS_HOME}/ftgl || echo not found ftgl
  debug_tec_uname
  make -e -j$(nproc) &> /tmp/ftgl.log
#+end_src



#+RESULTS:
| Tecmake: | Building | Dependencies               | ...                         | [                            | dep/cd.dep.Linux612_64       | ]                                  | (can                           | be                                 | slow)                          |                               |                                    |                              |                              |                             |                              |                            |                                |                                  |                                    |                               |                               |                               |                                  |                                    |                            |                            |                          |                            |                             |                           |                           |                                |                              |                             |                           |                            |                              |                          |                                |                            |                               |                          |                                  |                                     |                               |                                       |                             |                               |                                  |                                 |                                 |                              |                                 |                                  |                                |                                        |                                     |                             |
| rm       | -f       | ../lib/Linux612_64/libcd.a | ../lib/Linux612_64/libcd.so |                              |                              |                                    |                                |                                    |                                |                               |                                    |                              |                              |                             |                              |                            |                                |                                  |                                    |                               |                               |                               |                                  |                                    |                            |                            |                          |                            |                             |                           |                           |                                |                              |                             |                           |                            |                              |                          |                                |                            |                               |                          |                                  |                                     |                               |                                       |                             |                               |                                  |                                 |                                 |                              |                                 |                                  |                                |                                        |                                     |                             |
| rm       | -f       | ../obj/Linux612_64/cd.o    | ../obj/Linux612_64/wd.o     | ../obj/Linux612_64/wdhdcpy.o | ../obj/Linux612_64/rgb2map.o | ../obj/Linux612_64/cd_vectortext.o | ../obj/Linux612_64/cd_active.o | ../obj/Linux612_64/cd_attributes.o | ../obj/Linux612_64/cd_bitmap.o | ../obj/Linux612_64/cd_image.o | ../obj/Linux612_64/cd_primitives.o | ../obj/Linux612_64/cd_text.o | ../obj/Linux612_64/cd_util.o | ../obj/Linux612_64/base64.o | ../obj/Linux612_64/lodepng.o | ../obj/Linux612_64/cdsvg.o | ../obj/Linux612_64/cd_intcgm.o | ../obj/Linux612_64/cgm_bin_get.o | ../obj/Linux612_64/cgm_bin_parse.o | ../obj/Linux612_64/cgm_list.o | ../obj/Linux612_64/cgm_play.o | ../obj/Linux612_64/cgm_sism.o | ../obj/Linux612_64/cgm_txt_get.o | ../obj/Linux612_64/cgm_txt_parse.o | ../obj/Linux612_64/cddgn.o | ../obj/Linux612_64/cdcgm.o | ../obj/Linux612_64/cgm.o | ../obj/Linux612_64/cddxf.o | ../obj/Linux612_64/cdirgb.o | ../obj/Linux612_64/cdmf.o | ../obj/Linux612_64/cdps.o | ../obj/Linux612_64/cdpicture.o | ../obj/Linux612_64/cddebug.o | ../obj/Linux612_64/cdpptx.o | ../obj/Linux612_64/pptx.o | ../obj/Linux612_64/ioapi.o | ../obj/Linux612_64/minizip.o | ../obj/Linux612_64/zip.o | ../obj/Linux612_64/miniunzip.o | ../obj/Linux612_64/unzip.o | ../obj/Linux612_64/cdfontex.o | ../obj/Linux612_64/sim.o | ../obj/Linux612_64/cd_truetype.o | ../obj/Linux612_64/sim_primitives.o | ../obj/Linux612_64/sim_text.o | ../obj/Linux612_64/sim_linepolyfill.o | ../obj/Linux612_64/cd0wmf.o | ../obj/Linux612_64/cdgdkclp.o | ../obj/Linux612_64/cdcairodbuf.o | ../obj/Linux612_64/cdcairopdf.o | ../obj/Linux612_64/cdcairosvg.o | ../obj/Linux612_64/cdcairo.o | ../obj/Linux612_64/cdcairoimg.o | ../obj/Linux612_64/cdcairoirgb.o | ../obj/Linux612_64/cdcairops.o | ../obj/Linux612_64/cdcaironative_gdk.o | ../obj/Linux612_64/cdcairoprn_gtk.o | ../obj/Linux612_64/cd0emf.o |
| rm       | -f       | dep/cd.dep.Linux612_64     | ./cd                        | so_locations                 |                              |                                    |                                |                                    |                                |                               |                                    |                              |                              |                             |                              |                            |                                |                                  |                                    |                               |                               |                               |                                  |                                    |                            |                            |                          |                            |                             |                           |                           |                                |                              |                             |                           |                            |                              |                          |                                |                            |                               |                          |                                  |                                     |                               |                                       |                             |                               |                                  |                                 |                                 |                              |                                 |                                  |                                |                                        |                                     |                             |


** clean cd
#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/cd/src/ && make -f ../tecmake.mak clean clean-extra
  cd  ${TECTOOLS_HOME}/cd/ && rm -rf obj lib
  cd  ${TECTOOLS_HOME}/cd/ && find . -type d -name "dep" -exec rm -rf \{\} \;
      #+end_src



** build cd
#+begin_src bash :results output
  set -ev
  pkg-config --modversion gtk+-3.0 
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  env | egrep  '(LUA|TEC|EXCLUDE)'
  cd  ${TECTOOLS_HOME}/cd || (echo not found cd; exit 1)
  make -e -j$(nproc) &> /tmp/cd.log
#+end_src


** backup cd
#+begin_src bash :results output
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  backup_tecgraf_build_result cd
#+end_src

* IUP
- @see https://www.tecgraf.puc-rio.br/iup/en/guide.html

** svn install
- @see https://www.tecgraf.puc-rio.br/iup/en/svn.html
#+begin_src bash
  if [ -d "${TECTOOLS_HOME}/iup" ]; then
      echo "iup already checkuout."
  else
      cd "${TECTOOLS_HOME}"
      svn checkout -r5971 svn://svn.code.sf.net/p/iup/iup/trunk/iup iup
  fi
  exit 0
#+end_src


** patch to iup
#+begin_src bash
  set -ve
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  if [ ! -d "${TECTOOLS_HOME}/iup" ]; then
      echo "iup not found."
      exit 1
  fi
  patch_file="${TECGRAF_REPO_ROOT}/patches/iup.svn.diff"
  if [ ! -f "$patch_file" ]; then
      echo "patchfile not found."
      exit 1
  fi
  cd "${TECTOOLS_HOME}/iup"
  patch -p0 "$patch_file"
  exit 0
  #+end_src

** install iup-go
- https://github.com/gen2brain/iup-go.git
#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  if [ -d "${LOCAL_IUP_GO_REPO}" ]; then
      echo "iup-go already checkuout."
  else
      cd "${TECTOOLS_HOME}"
      git clone "${REMOTE_IUP_GO_REPO}"
  fi
#+end_src


** overwrite iup-go
#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  SRC="${TECTOOLS_HOME}/iup-go/iup/external/include"
  DST="${TECTOOLS_HOME}/iup/include"
  if [ ! -d "$SRC" ]; then
      echo "not found $SRC"
      exit 1
  fi
  if [ ! -d "$DST" ]; then
      echo "not found $DST"
      exit 1
  fi
  rsync -av $SRC/ $DST/
#+end_src



#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  SRC="${TECTOOLS_HOME}/iup-go/iup/external/src"
  DST="${TECTOOLS_HOME}/iup/src"
  if [ ! -d "$SRC" ]; then
      echo "not found $SRC"
      exit 1
  fi
  if [ ! -d "$DST" ]; then
      echo "not found $DST"
      exit 1
  fi
  rsync -av $SRC/ $DST/
#+end_src


** fix: src/libjasper2/base/jas_stream.c
#+begin_src c
  // add: kenjirofukuda@gmail.com
  #define JAS_HAVE_UNISTD_H 1
#+end_src

** install libjasper
#+begin_src bash
  # void linux
  sudo xbps-install jasper jasper-devel libjasper
  sudo xbps-install lua lua-devel
#+end_src


** clean iup
#+begin_src bash
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/iup/src/ && make -f ../tecmake.mak clean clean-extra
  cd  ${TECTOOLS_HOME}/iup/ && rm -rf obj lib
  cd  ${TECTOOLS_HOME}/iup/ && find . -type f -name "*.dep" -exec rm -rf \{\} \;
  cd  ${TECTOOLS_HOME}/iup/ && find . -type d -name "dep" -exec rm -rf \{\} \;
#+end_src



** build iup
#+begin_src bash :results output
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  cd  ${TECTOOLS_HOME}/iup || (echo not found iup; exit 1)
  pwd
  env | egrep  '(LUA|TEC)'
  rm -rf /tmp/iup.log
  cd  ${TECTOOLS_HOME}/iup && make -e -j$(nproc) &> /tmp/iup.log
#+end_src


** backup iup
#+begin_src bash :results output
  set -ev
  . "${TECGRAF_REPO_ROOT}/bin/bashrc_tecgraf"
  . /tmp/target.env
  backup_tecgraf_build_result iup
#+end_src
